run-SNOWPACKFoam/BYL-tundra-2018-2019-noHet-drift/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        //value           uniform 101325;
        
        //type            zeroGradient;               
        
        //type            totalPressure;
        //p0              uniform 101325;

        //type            fixedValue;
        //value           uniform 101325;  
        
		//type			 prghPressure;
		//p 				 uniform 0;
              
	}

    bottom
    {
        type            fixedFluxPressure;
        //value           uniform 101325;
        
        //type            zeroGradient;               
        
        //type            totalPressure;
        //p0              uniform 101325;

        //type            fixedValue;
        //value           uniform 101325;
        
		//type			 prghPressure;
		//p 				 uniform 0;                        
    }

    left
    {
        type            cyclic;
        
        //type            fixedFluxPressure;
        //value           uniform 101325;
    }

    right
    {
        type            cyclic;
        
        //type            fixedFluxPressure;
        //value           uniform 101325;                        
    }

    frontAndBack
    {
        type empty;
    } 
}

// ************************************************************************* //
