run-SNOWPACKFoam/BYL-tundra-2018-2019-noHet-drift/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//#include	"../constant/transportProperties" 

numberOfSubdomains 8;//$numberOfMPIs;
method          simple;

constraints
{
	// Keep owner and neighbour on same processor for faces in patches
    // (only makes sense for cyclic patches. Not suitable for e.g.
    // cyclicAMI since these are not coupled on the patch level.
    // Use singleProcessorFaceSets for those.
    patches
    {
        type    preservePatches;
        // the name of patch either can be between "" or without "".
		// It works also just to put cyclic even though it is not the name of patch but it is the type.
        patches (cyclic);//(left right);("cyclic"); 
        enabled true;
    }  
} 


simpleCoeffs
{
    n               ($numberOfSubdomains 1 1);//($numberOfMPIsX $numberOfMPIsY $numberOfMPIsZ);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               ( 4 1 1 );
    delta           0.001;
    order           xyz;
}

metisCoeffs
{
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

//// Is the case distributed
//distributed     yes;
//// Per slave (so nProcs-1 entries) the directory above the case.
//roots           
//(
//    "/tmp"
//    "/tmp"
//);


// ************************************************************************* //
